app/android/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":about:data" [fillcolor="#160185"]
  ":about:ui" [fillcolor="#6b6b01"]
  ":about:vm" [fillcolor="#914141"]
  ":account:domain" [fillcolor="#160185"]
  ":account:ui" [fillcolor="#6b6b01"]
  ":account:vm" [fillcolor="#914141"]
  ":api:actual" [fillcolor="#160185"]
  ":api:builder" [fillcolor="#160185"]
  ":api:github" [fillcolor="#160185"]
  ":app:android" [fillcolor="#7a0101"]
  ":app:di" [fillcolor="#a17103"]
  ":app:nav" [fillcolor="#6b6b01"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:encryption" [fillcolor="#160185"]
  ":budget:list:ui" [fillcolor="#6b6b01"]
  ":budget:list:vm" [fillcolor="#914141"]
  ":budget:model" [fillcolor="#160185"]
  ":budget:reports:ui" [fillcolor="#6b6b01"]
  ":budget:reports:vm" [fillcolor="#914141"]
  ":budget:sync:ui" [fillcolor="#6b6b01"]
  ":budget:sync:vm" [fillcolor="#914141"]
  ":budget:transactions:ui" [fillcolor="#6b6b01"]
  ":budget:transactions:vm" [fillcolor="#914141"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:connection" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":core:ui" [fillcolor="#6b6b01"]
  ":l10n" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":settings:ui" [fillcolor="#6b6b01"]
  ":settings:vm" [fillcolor="#914141"]
  ":about:data" -> ":api:github" [style="bold"]
  ":about:ui" -> ":about:vm" [style="bold"]
  ":about:ui" -> ":core:ui" [style="bold"]
  ":about:ui" -> ":l10n" [style="dashed"]
  ":about:vm" -> ":about:data" [style="bold"]
  ":about:vm" -> ":core:di" [style="bold"]
  ":about:vm" -> ":logging" [style="dashed"]
  ":account:domain" -> ":api:actual" [style="dashed"]
  ":account:domain" -> ":core:model" [style="bold"]
  ":account:domain" -> ":logging" [style="dashed"]
  ":account:domain" -> ":prefs" [style="dashed"]
  ":account:ui" -> ":account:domain" [style="dashed"]
  ":account:ui" -> ":account:vm" [style="bold"]
  ":account:ui" -> ":core:model" [style="bold"]
  ":account:ui" -> ":core:ui" [style="bold"]
  ":account:ui" -> ":l10n" [style="dashed"]
  ":account:ui" -> ":logging" [style="dashed"]
  ":account:vm" -> ":account:domain" [style="bold"]
  ":account:vm" -> ":api:actual" [style="dashed"]
  ":account:vm" -> ":core:di" [style="bold"]
  ":account:vm" -> ":core:model" [style="bold"]
  ":account:vm" -> ":logging" [style="dashed"]
  ":account:vm" -> ":prefs" [style="bold"]
  ":api:actual" -> ":budget:model" [style="bold"]
  ":api:actual" -> ":codegen:annotation" [style="dashed"]
  ":api:actual" -> ":core:model" [style="bold"]
  ":api:builder" -> ":core:model" [style="bold"]
  ":api:builder" -> ":logging" [style="dashed"]
  ":api:github" -> ":codegen:annotation" [style="dashed"]
  ":api:github" -> ":core:model" [style="bold"]
  ":app:android" -> ":app:di" [style="dashed"]
  ":app:android" -> ":app:nav" [style="dashed"]
  ":app:android" -> ":prefs" [style="dashed"]
  ":app:di" -> ":api:builder" [style="dashed"]
  ":app:di" -> ":api:github" [style="bold"]
  ":app:di" -> ":budget:model" [style="bold"]
  ":app:di" -> ":core:di" [style="bold"]
  ":app:di" -> ":core:model" [style="bold"]
  ":app:di" -> ":prefs" [style="bold"]
  ":app:nav" -> ":about:ui" [style="bold"]
  ":app:nav" -> ":account:ui" [style="bold"]
  ":app:nav" -> ":budget:list:ui" [style="bold"]
  ":app:nav" -> ":budget:reports:ui" [style="bold"]
  ":app:nav" -> ":budget:sync:ui" [style="bold"]
  ":app:nav" -> ":budget:transactions:ui" [style="bold"]
  ":app:nav" -> ":core:connection" [style="bold"]
  ":app:nav" -> ":core:ui" [style="bold"]
  ":app:nav" -> ":core:ui" [style="dashed"]
  ":app:nav" -> ":l10n" [style="bold"]
  ":app:nav" -> ":logging" [style="bold"]
  ":app:nav" -> ":settings:ui" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":budget:encryption" -> ":budget:model" [style="bold"]
  ":budget:encryption" -> ":core:model" [style="bold"]
  ":budget:list:ui" -> ":budget:list:vm" [style="bold"]
  ":budget:list:ui" -> ":budget:model" [style="dashed"]
  ":budget:list:ui" -> ":core:model" [style="dashed"]
  ":budget:list:ui" -> ":core:ui" [style="bold"]
  ":budget:list:ui" -> ":l10n" [style="dashed"]
  ":budget:list:vm" -> ":api:actual" [style="dashed"]
  ":budget:list:vm" -> ":budget:model" [style="bold"]
  ":budget:list:vm" -> ":core:di" [style="bold"]
  ":budget:list:vm" -> ":core:model" [style="bold"]
  ":budget:list:vm" -> ":logging" [style="dashed"]
  ":budget:list:vm" -> ":prefs" [style="dashed"]
  ":budget:reports:ui" -> ":budget:reports:vm" [style="bold"]
  ":budget:reports:ui" -> ":core:model" [style="dashed"]
  ":budget:reports:ui" -> ":core:ui" [style="bold"]
  ":budget:reports:ui" -> ":l10n" [style="dashed"]
  ":budget:reports:vm" -> ":budget:model" [style="bold"]
  ":budget:reports:vm" -> ":core:di" [style="bold"]
  ":budget:reports:vm" -> ":core:di" [style="dashed"]
  ":budget:reports:vm" -> ":core:model" [style="dashed"]
  ":budget:reports:vm" -> ":logging" [style="dashed"]
  ":budget:sync:ui" -> ":budget:sync:vm" [style="bold"]
  ":budget:sync:ui" -> ":core:model" [style="dashed"]
  ":budget:sync:ui" -> ":core:ui" [style="bold"]
  ":budget:sync:ui" -> ":l10n" [style="dashed"]
  ":budget:sync:vm" -> ":api:actual" [style="dashed"]
  ":budget:sync:vm" -> ":budget:encryption" [style="bold"]
  ":budget:sync:vm" -> ":budget:model" [style="bold"]
  ":budget:sync:vm" -> ":core:di" [style="bold"]
  ":budget:sync:vm" -> ":core:model" [style="dashed"]
  ":budget:sync:vm" -> ":logging" [style="dashed"]
  ":budget:sync:vm" -> ":prefs" [style="dashed"]
  ":budget:transactions:ui" -> ":budget:model" [style="bold"]
  ":budget:transactions:ui" -> ":budget:transactions:vm" [style="bold"]
  ":budget:transactions:ui" -> ":core:model" [style="dashed"]
  ":budget:transactions:ui" -> ":core:ui" [style="bold"]
  ":budget:transactions:ui" -> ":l10n" [style="dashed"]
  ":budget:transactions:vm" -> ":budget:data" [style="bold"]
  ":budget:transactions:vm" -> ":budget:model" [style="bold"]
  ":budget:transactions:vm" -> ":core:di" [style="bold"]
  ":budget:transactions:vm" -> ":core:di" [style="dashed"]
  ":budget:transactions:vm" -> ":core:model" [style="dashed"]
  ":budget:transactions:vm" -> ":logging" [style="dashed"]
  ":budget:transactions:vm" -> ":prefs" [style="dashed"]
  ":core:connection" -> ":api:actual" [style="bold"]
  ":core:connection" -> ":api:builder" [style="bold"]
  ":core:connection" -> ":core:model" [style="dashed"]
  ":core:connection" -> ":logging" [style="dashed"]
  ":core:connection" -> ":prefs" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":core:di" [style="dashed"]
  ":core:ui" -> ":core:model" [style="bold"]
  ":core:ui" -> ":l10n" [style="dashed"]
  ":prefs" -> ":core:model" [style="bold"]
  ":settings:ui" -> ":core:model" [style="bold"]
  ":settings:ui" -> ":core:ui" [style="bold"]
  ":settings:ui" -> ":l10n" [style="dashed"]
  ":settings:ui" -> ":settings:vm" [style="bold"]
  ":settings:vm" -> ":core:di" [style="bold"]
  ":settings:vm" -> ":logging" [style="dashed"]
  ":settings:vm" -> ":prefs" [style="bold"]
}
